// ===常數 =======================================
// 1. 要初始化：宣告後要給初始值
// 如果沒有一開始給值，他又不能改值，這變數就永遠沒有值，沒有用
// 2.不能改值

// =====資料型別====================================
// Number 存數字
// ==============
// 表達式1+2+3 也屬於屬於範疇
// 因為數字加數字還是數字
// 1.7e2 =170 ,e是科學記號

// String 存文字
// ===============
// 使用者要輸入字串
// 或是畫面上顯示文字

// 'l 'm Ann '  只有I被當字串
// 'l \'m Ann '  加個槓代表這不是字串結尾

// "this is a double quote\""
// 會印出想要的雙引號會保留
// 'this is a double quote"'

//====undefined出現原因==================================
//下面用node打
//  let i=0; => 出現undefined
//因為是個陳述式，本身沒有值
//i++ => 0，因為i=0
//i =>1，再印一次i ，i是做完i++了
//console.log(1);  是個陳述式，印出1，這陳述式本身值是undefined
//1
//undefined

//==== undefined & null =================================
//====undefined 未定義 =====
// undefined 發生在沒賦值時(預設)
//==== null 空值 ===========
//發生在 手動設變數為 null

let a;
console.log(a); //undefined

a = null; //也可以直接設成undefined
console.log(a); //null

// ====知道型態typeof===================================
// typeof 1 => ‘number’

// typeof ‘123123’  => ‘string’

// const str = ‘the ’
// typeof str  => ‘string’

// ===字串跟變數的差異===================================

// const a = ‘123’

// console.log(a + “456”);
// => 123456
// console.log(“a” + “456”);
// => a456

// ===template string==================================
// 在字串中插入表達式
// const str2= `我$｛5-3｝歲`；
// 反引號 錢字號 大括號裡面表達式
// 中間插入變數或是表達式
// 比用+快
